// BSLLS:LatinAndCyrillicSymbolInWord-off

#Область СлужебныйПрограммныйИнтерфейс

Функция КаталогТестовыхДанных() Экспорт
	Возврат "fixtures";
КонецФункции

Функция КаталогНастроек() Экспорт
	Возврат ОбъединитьПути(КаталогТестовыхДанных(), "configs");
КонецФункции

Функция КаталогЗамеров() Экспорт
	Возврат ОбъединитьПути(КаталогТестовыхДанных(), "coverages");
КонецФункции

Функция ЧислоСтрокРезультата(ИмяФайлаРезультатов) Экспорт
	
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ИмяФайлаРезультатов);
	ЧислоСтрок = СтрЧислоСтрок(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();
	
	Возврат ЧислоСтрок;
	
КонецФункции

Процедура ВыполнитьКомандуКонвертировать(Аргументы) Экспорт
	
	Команда = Новый КомандаПриложения("testapp", "Тестовое приложения", Новый КомандаКонвертировать());
	Команда.Опция("d debug", Ложь, "Режим отладки").ТБулево();
	Команда.НачалоЗапуска();
	Команда.Запуск(Аргументы);

КонецПроцедуры

Процедура ДобавитьАргументInput(Аргументы, Значение) Экспорт
	
	Аргументы.Добавить("--input");
	Аргументы.Добавить(Значение);
	
КонецПроцедуры

Процедура ДобавитьАргументOutput(Аргументы, Значение) Экспорт
	
	Аргументы.Добавить("--output");
	Аргументы.Добавить(Значение);
	
КонецПроцедуры

Процедура ДобавитьАргументWorkspace(Аргументы, Значение) Экспорт
	
	Аргументы.Добавить("--workspace");
	Аргументы.Добавить(Значение);
	
КонецПроцедуры

Процедура ДобавитьАргументSources(Аргументы, Значение) Экспорт
	
	Аргументы.Добавить("--sources");
	Аргументы.Добавить(Значение);
	
КонецПроцедуры

Процедура ДобавитьАргументFormat(Аргументы, Значение) Экспорт
	
	Аргументы.Добавить("--format");
	Аргументы.Добавить(Значение);
	
КонецПроцедуры

Процедура ДобавитьАргументСonfig(Аргументы, Значение) Экспорт
	
	Аргументы.Добавить("--config");
	Аргументы.Добавить(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти