
#Область ПрограммныйИнтерфейс

Перем МодульУправляемогоПриложения Экспорт;
Перем МодульСеанса Экспорт;
Перем ОбщийМодуль Экспорт;
Перем МодульОбъекта Экспорт;
Перем МодульМенеджера Экспорт;

#КонецОбласти

МодульУправляемогоПриложения = "d22e852a-cf8a-4f77-8ccb-3548e7792bea";
МодульСеанса                 = "9b7bbbae-9771-46f2-9e4d-2489e0ffc702";
ОбщийМодуль                  = "d5963243-262e-4398-b4d7-fb16d06484f6";
МодульОбъекта                = "a637f77f-3840-441d-a1c3-699c8c5cb7e0";
МодульМенеджера              = "d1b64a2c-8078-4982-8190-8f81aefda192";
