
#Использовать 1testrunner
#Использовать fs

Функция ПрогнатьТесты(КонтейнерТестов)
	
	Тестер = Новый Тестер;
	КаталогТестов = Новый Файл(КонтейнерТестов);
	КаталогОтчета = Новый Файл(".temp");
	ФС.ОбеспечитьПустойКаталог(".temp");

	Если КаталогТестов.ЭтоКаталог() Тогда
		Тестер.ТестироватьКаталог(КаталогТестов, КаталогОтчета);
	Иначе
		Тестер.ТестироватьФайл(КаталогТестов, КаталогОтчета);
	КонецЕсли;

	Возврат Истина;

КонецФункции

Если АргументыКоманднойСтроки.Количество() = 0 Тогда
	КонтейнерТестов = "tests";
Иначе
	КонтейнерТестов = АргументыКоманднойСтроки[0];
КонецЕсли;
	
ТестыПрошлиУспешно = ПрогнатьТесты(КонтейнерТестов);

Если Не ТестыПрошлиУспешно Тогда
	Сообщить("Тесты провалены");
	ЗавершитьРаботу(-1);
КонецЕсли;