
#Использовать fs
#Использовать cli
#Использовать asserts
#Использовать "../internal/cmd"

Перем Тестер;
Перем КаталогСборки;

#Область ОбработчикиСобытий

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт
	
	Тестер = Тестирование;

	ИменаТестов = Новый Массив;
	ИменаТестов.Добавить("ТестДолжен_КонвертироватьXML");
	ИменаТестов.Добавить("ТестДолжен_КонвертироватьEDT");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
	КаталогСборки = Тестер.ИмяВременногоФайла();
	ФС.ОбеспечитьПустойКаталог(КаталогСборки);

КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт

	Тестер.УдалитьВременныеФайлы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТестов

Процедура ТестДолжен_КонвертироватьXML() Экспорт

	ИмяФайлаРезультатов = ОбъединитьПути(КаталогСборки, "coverageXML.json");

	Аргументы = Новый Массив;
	Аргументы.Добавить("--input");
	Аргументы.Добавить("tests\testdata\coverage.csv");
	
	Аргументы.Добавить("--output");
	Аргументы.Добавить(ИмяФайлаРезультатов);
	
	Аргументы.Добавить("--workspace");
	Аргументы.Добавить("tests\testdata");

	Аргументы.Добавить("--sources");
	Аргументы.Добавить("src\xml");
	
	Аргументы.Добавить("--format");
	Аргументы.Добавить("XML");
	
	Команда =  Новый КомандаПриложения("testapp", "Тестовое приложения", Новый КомандаКонвертировать());
	Команда.Опция("d debug", Ложь, "Режим отладки").ТБулево();
	Команда.НачалоЗапуска();
	Команда.Запуск(Аргументы);

	Утверждения.ПроверитьИстину(
		ФС.ФайлСуществует(ИмяФайлаРезультатов), 
		"Файл с результатами должен существовать");
	
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ИмяФайлаРезультатов);
	ЧислоСтрок = СтрЧислоСтрок(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();

	Утверждения.ПроверитьРавенство(ЧислоСтрок, 232, 
		"Проверка количества строк в результате");
	
КонецПроцедуры	

Процедура ТестДолжен_КонвертироватьEDT() Экспорт

	ИмяФайлаРезультатов = ОбъединитьПути(КаталогСборки, "coverageEDT.json");
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("--input");
	Аргументы.Добавить("tests\testdata\coverage.csv");
	
	Аргументы.Добавить("--output");
	Аргументы.Добавить(ИмяФайлаРезультатов);
	
	Аргументы.Добавить("--workspace");
	Аргументы.Добавить("tests\testdata");

	Аргументы.Добавить("--sources");
	Аргументы.Добавить("src\edt");
	
	Аргументы.Добавить("--format");
	Аргументы.Добавить("EDT");
	
	Команда =  Новый КомандаПриложения("testapp", "Тестовое приложения", Новый КомандаКонвертировать());
	Команда.Опция("d debug", Ложь, "Режим отладки").ТБулево();
	Команда.НачалоЗапуска();
	Команда.Запуск(Аргументы);

	Утверждения.ПроверитьИстину(
		ФС.ФайлСуществует(ИмяФайлаРезультатов), 
		"Файл с результатами должен существовать");
	
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ИмяФайлаРезультатов);
	ЧислоСтрок = СтрЧислоСтрок(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();

	Утверждения.ПроверитьРавенство(ЧислоСтрок, 232, 
		"Проверка количества строк в результате");
	
КонецПроцедуры	

#КонецОбласти
